Revit 2027 API
FabricationPart.InsulationThickness Property
 The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InsulationThickness { get; }
Public ReadOnly Property InsulationThickness As Double
	Get
public:
property double InsulationThickness {
	double get ();
}
member InsulationThickness : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace